// ПРЕОБРАЗОВАНИЕ ДАТЫ
Процедура ПреобразованиеСтрокиКДате()
	// Простейший способ, который подходит,
	// Если строка с датой каноническому формату YYYYMMDDhhmmss это использовать метод Дата()
	Дата("20211231123456");
	Дата("24.12.2022 12:34:56")
	Дата("2021", "12", "24", "12", "34", "56")
	
	// Дата из строки с разделителями
	ДатаСтрокой = "2021/12-31 12:34:56"
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "-", "");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "/", "");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ":", "");
	Дата(ДатаСтрокой);
	
КонецПроцедуры


// РАБОТА С ФОРМАТОМ
Процедура РаботаСФорматомДатыЧислаБулева()
	/// Как указать общее число цифр в 1с 8.3, 8.2
	Формат(125, "ЧЦ=2"); // 99
	Формат(125, "ЧЦ=1"); // 9
	
	/// Как указать число цифр после запятой в 1с 8.3, 8.2
	Формат(125.368, "ЧДЦ=2"); // 125.37
	Формат(125.368, "ЧДЦ=1"); // 125.4
	
	/// Как сдвинуть разряды числа в 1с 8.3, 8.2
	Формат(2, "ЧС=1"); // 0,2
	Формат(2, "ЧС=-2"); // 200
	
	/// Как задать разделитель целой и дробной части в 1с 8.3, 8.2
	Формат(125.36, "ЧРД=^"); // 125^36
	
	/// Как задать разделитель групп в 1с 8.3, 8.2
	Формат(10000000, "ЧРГ=*"); // 10*000*000
	
	/// Как задать нулевое представление числа в 1с 8.3, 8.2
	Формат(0, "ЧН=ноль"); // ноль
	
	/// Как заставить выводить лидирующие нули в 1с 8.3, 8.2
	Формат(125, "ЧЦ=10; ЧВН="); // 0 000 000 125
	Формат(5, "ЧЦ=2; ЧВН="); // 05
	
	/// Как отключить группировку разрядов при выводе числа
	/// в 1с 8.3, 8.2
	Формат(1000000, "ЧГ=0"); // 1000000
	
	/// Как получить отдельные компоненты даты при выводе
	/// в 1с 8.3, 8.2
	Дата = '20050101200103'; // 01 января 2005 года 20:01:03
	
	// год
	Формат(Дата, "ДФ=г"); // 5
	Формат(Дата, "ДФ=гг"); // 05
	Формат(Дата, "ДФ=гггг"); // 2005
	
	// номер квартала
	Формат(Дата, "ДФ=к"); // 1
	
	// месяц
	Формат(Дата, "ДФ=М"); // 1
	Формат(Дата, "ДФ=ММ"); // 01
	Формат(Дата, "ДФ=МММ"); // янв.
	Формат(Дата, "ДФ=ММММ"); // Январь
	
	// день
	Формат(Дата, "ДФ=д"); // 1
	Формат(Дата, "ДФ=дд"); // 01
	Формат(Дата, "ДФ=ддд"); // Сб
	Формат(Дата, "ДФ=дддд"); // суббота
	
	// час
	Формат(Дата, "ДФ=ч"); // 8
	Формат(Дата, "ДФ=чч"); // 08
	Формат(Дата, "ДФ=Ч"); // 20
	Формат(Дата, "ДФ=ЧЧ"); // 20
	
	// минута
	Формат(Дата, "ДФ=м"); // 1
	Формат(Дата, "ДФ=мм"); // 01
	
	// секунда
	Формат(Дата, "ДФ=с"); // 3
	Формат(Дата, "ДФ=сс"); // 03
	
	/// Как задать локальный формат даты при выводе в 1с 8.3, 8.2
	
	Формат(Дата, "ДЛФ=Д"); // 01.01.2005
	Формат(Дата, "ДЛФ=ДД"); // 1 января 2005 г.
	Формат(Дата, "ДЛФ=В"); // 20:01:03
	Формат(Дата, "ДЛФ=ДДВ"); // 1 января 2005 г. 20:01:03
	Формат(Дата, "ДЛФ=ДВ"); // 01.01.2005 20:01:03
	
	/// Как задать нулевое представление даты при выводе в 1с 8.3, 8.2
	
	Формат('00010101000000', "ДП=""пустая дата"""); // пустая дата
	
	/// Как задать представление значения типа Булево
	/// при выводе в 1с 8.3, 8.2
	Формат(Ложь, "БЛ=""врёшь!"""); // врёшь!
	Формат(Истина, "БИ=""правду говоришь"""); // правду говоришь
	
	/// Как задать представление периода при выводе в 1с 8.3, 8.2
	// 3 кв. 2013 г., влияет, если 6 или 9 месяцев
	ПредставлениеПериода(НачалоКвартала(ТекущаяДата()), КонецКвартала(ТекущаяДата()), "ФП=Истина");
	
	/// Как задать число прописью при выводе в 1с 8.3, 8.2
	ЧислоПрописью(123.65); // Сто двадцать три  65
	
	
	ЧислоПрописью(123.65, , "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2"); // Сто двадцать три рубля 65 копеек
	
КонецПроцедуры