Процедура GETЗапрос()
	Сервер = "httpbin.org";
	Ресурс = "/get";
	Параметры = "&param=1";
	// https соединение с сервером
	Соединение = Новый HTTPСоединение(Сервер, 443, , , , 10, Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json;");
	Запрос = Новый HTTPЗапрос(Ресурс + Параметры, Заголовки);
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния <> 200 Тогда
		Сообщить("Код ответа: " + Ответ.КодСостояния);
		Возврат;
	КонецЕсли;
	
	// Десериализация ответа из строки json в соответствие
	ДанныеСоответствие = ДесериализацияJSON(Ответ.ПолучитьТелоКакСтроку());
	Сообщить(ДанныеСоответствие.Получить("key"));
	
КонецПроцедуры

Процедура POSTЗапрос()
	Сервер = "httpbin.org";
	Ресурс = "/post";
	ТелоСообщения = "{""key""=""value""}";
	// https соединение с сервером
	Соединение = Новый HTTPСоединение(Сервер, 443, , , , 10, Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json;");
	Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоСообщения);
	
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния <> 200 Тогда
		Сообщить("Код ответа: " + Ответ.КодСостояния);
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура GETБинарныеДанные()
	Сервер = "httpbin.org";
	Ресурс = "/image/jpeg";
	// https соединение с сервером
	Соединение = Новый HTTPСоединение(Сервер, 443, , , , 10, Новый ЗащищенноеСоединениеOpenSSL);

	Запрос = Новый HTTPЗапрос(Ресурс + Параметры);
	Ответ = Соединение.Получить(Запрос);
	Если Ответ.КодСостояния <> 200 Тогда
		Сообщить("Код ответа: " + Ответ.КодСостояния);
		Возврат;
	КонецЕсли;
	// Сама картинка - уже в теле ответа, осталось
    // только записать её в файл на диск в виде двоичных данных.
 
    КаталогДляЭкспериментов = КаталогДокументов() + "\images";
    СоздатьКаталог(КаталогДляЭкспериментов);
    ПутьКФайлуКартинки = КаталогДляЭкспериментов + "\test.jpg";

    // Записываем картинку на диск.
    Результат.ПолучитьТелоКакДвоичныеДанные().Записать(ПутьКФайлуКартинки);
    Сообщить("Сохранили картинку по адресу " + ПутьКФайлуКартинки);
 
    // Покажем картинку пользователю.
    ЗапуститьПриложение(ПутьКФайлуКартинки);    
	
КонецПроцедуры

/// Как обработать перенаправление в http-запросе
Процедура КакОбработатьПеренаправлениеВHttpЗапросеНаКлиенте()
	
	// Предположим, что мы хотим отправить поисковый http запрос
	// гуглу и получить от него страницу с результатами нашего
	// запроса.
	
	// К примеру, будем искать по строке "работа программистом 1с в моём городе".
	Соединение = Новый HTTPСоединение("www.google.com", 80, , , , 10);
	
	Запрос = Новый HTTPЗапрос("/search?q=работа программистом 1с в моём городе");
	Результат = Соединение.Получить(Запрос);
	Если Результат.КодСостояния = 302 Тогда
		Сообщить("Нас перенаправили на другую страницу.");
		Сообщить("Адрес этой страницы находится в заголовке результата Location.");
		Сообщить("Вот он: " + Результат.Заголовки.Получить("Location"));
		
		// Воспользуемся вспомогательной функцией СтруктураURI, которая
		// сама вытаскивает из адреса имя хоста, порт и путь к ресурсу.
		
		URI = СтруктураURI(Результат.Заголовки.Получить("Location"));
		
		// Делаем новое подключение и get запрос.
		
		Соединение = Новый HTTPСоединение(URI.Хост, URI.Порт);
		Запрос = Новый HTTPЗапрос(URI.ПутьНаСервере);
		Результат = Соединение.Получить(Запрос);
		// Сохраним тело ответа (это и есть наша страница с результатами
		// поиска) в виде htm файла и тут же покажем его пользователю.
	КонецЕсли;
КонецПроцедуры

// Выполняет преобразование json из строки в Соответствие
//
// Параметры:
//  СтрокаJSON  - Строка - Json в виде строки
//
// Возвращаемое значение:
//   Соответствие   - Иерархическое представление json в виде соответствия
//
Функция ДесериализацияJSON(СтрокаJSON)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Данные = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	Возврат Данные;
	
КонецФункции

Функция СериализацияJSON(Данные)

    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Данные, Настройки);
    СтрокаJSON = ЗаписьJSON.Закрыть();
    
    Возврат СтрокаJSON;

КонецФункции

Процедура ПолучитьТелоСообщения()
	
КонецПроцедуры
