Функция СериализоватьВJSON(Данные)

	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
    
КонецФункции

Функция ДесериализоватьJSON(СтрокаJSON, ПрочитатьВСоответствие)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции 

// Используется для быстрой сериализации прикладного типа (справочник, документ и т.п.)
Функция СериализоватьПрикладнойТипаДанныхВJSON(ДанныеОбъект)
	
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб); 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ДанныеОбъект, НазначениеТипаXML.Явное); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON ;
	
КонецФункции

// Используется для быстрой десериализации прикладного типа (справочник, документ и т.п.)
Функция ДесериализоватьJSONВПрикладнойТипДанных(СтрокаJSON) 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Данные = СериализаторXDTO.ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат Данные;
	
КонецФункции