// Выполняет преобразование json из строки в Соответствие
//
// Параметры:
//  СтрокаJSON  - Строка - Json в виде строки
//
// Возвращаемое значение:
//   Соответствие   - Иерархическое представление json в виде соответствия
//
Функция ДесериализацияJSON(СтрокаJSON)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Данные = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();
	
	Возврат Данные;
	
КонецФункции

Функция СериализацияJSON(Данные)

  ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб) 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON ;

КонецФункции

// Используется для быстрой десериализации прикладного типа (справочник, документ и т.п.)
Функция ДесериализацияПрикладногоТипаДанныхJSON(СтрокаJSON)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Данные = СериализаторXDTO.ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат Данные;
	
КонецФункции

// Используется для быстрой сериализации прикладного типа (справочник, документ и т.п.)
Функция СериализацияПрикладногоТипаДанныхJSON(КонтрагентСсылка)

  ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб) 
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);

  Данные = КонтрагентСсылка.ПолучитьОбъект();
  СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Данные, НазначениеТипаXML.Явное); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON ;

КонецФункции

