&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ПолеВвода = Элементы.Добавить(
		"Комментарий",    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		ЭтаФорма);	      //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = "Комментарий";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "Объект.Комментарий";
	
	//Можно добавить обработчик события
	//См. синтакс-помощник чтобы узнать список событий
	// Интерфейс (управляемый) -> Поле формы -> ПолеФормы -> События
	// а так же остальные варианты расширения поля формы в зависимости от вида кнопки
	// Интерфейс (управляемый) -> Поле формы -> Расширение поля ввода -> События
	// и прочее
	ПолеВвода.УстановитьДействие(
		"ПриИзменении", 		    //Имя события
		"ПриИзмененииКомментария"); //Имя процедуры обработчика
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКомментария(Элемент)
	
	Сообщить("Поле ""Комментарий"" изменено!");
	
КонецПроцедуры