// BSLLS-off
// Как создать массив (сразу нужного размера) в 1с 8.3, 8.2
Процедура СоздатьМассивНужногоРазмер()
 
    // в массиве сразу 3 элемента
    Числа = Новый Массив(3);
 
    // инициализируем их значениями
    Числа[0] = 5;
    Числа[1] = Числа[0] * 2; // 10
    Числа[2] = Числа[1] * 2; // 20

КонецПроцедуры
 
// Как создать пустой массив (с последующим добавлением элементов) в 1с 8.3, 8.2
Процедура СоздатьПустойМассив()
 
    // в массиве 0 элементов
    Числа = Новый Массив;
 
    // добавляем последовательно три элемента
    Числа.Добавить(100); // (100)
    Числа.Добавить(300); // (100, 300)
    Числа.Добавить(500); // (100, 300, 500)
 
КонецПроцедуры

// Как обойти массив
Процедура ОбходМассива()
 
    // в массиве 0 элементов
    массив = Новый Массив;
 
    // добавляем последовательно три элемента
    массив.Добавить("Привет мир"); // (100)
    массив.Добавить("300"); // (100, 300)
    массив.Добавить(500); // (100, 300, 500)
 
	// Обход элементов
	Для каждого ЭлементМассив из массив Цикл
		Сообщить(ЭлементМассив)
	КонецЦикла

	// Обход по индексу
	Для Индекс = 0 По массив.Количество()-1 Цикл
		Сообщить(массив[Индекс])
	КонецЦикла 
КонецПроцедуры
