//////////////////////////////////////////////////////////
//	ЧТЕНИЕ EXCEL ПРИ ПОМОЩИ ТАБЛИЧНОГО ДОКУМЕНТА
//////////////////////////////////////////////////////////

&НаКлиенте
Асинх Процедура ПрочитатьExcel(Команда)
		
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр = "Таблица Excel | *.xls; *.xlsx";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога);
	Если ОписаниеФайла <> Неопределено Тогда
		ПрочитатьExcelНаСервере(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл.Расширение);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьExcelНаСервере(АдресДанных, РасширениеФайла)
	
	ПутьКфайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);         
	
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	Данные.Записать(ПутьКфайлу);
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();

	ПрочитатьExcel_ТабличныйДокумент(ПутьКфайлу);	
	
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Длительность = (ВремяОкончания - ВремяНачала) / 1000;
	
	// удаление временного файла
	УдалитьФайлы(ПутьКфайлу);
		
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон("Обработка файла завершена! Способ: %1; Длительность операции: %2",
								Способ, Длительность);
	Сообщение.Сообщить();

КонецПроцедуры // ПрочитатьExcelВТаблицуЗначений()      

&НаСервере
Процедура ПрочитатьExcel_ТабличныйДокумент(ПутьКФайлу)

	ТаблицаТоваров.Очистить();
	
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Прочитать(ПутьКФайлу);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();                                                        
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоКолонок = ТабДок.ШиринаТаблицы;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		Если НомерСтроки = 1 Тогда
			Продолжить;			
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаТоваров.Добавить();
		СтрокаТаблицы.Наименование	= ТабДок.Область(НомерСтроки, 1).Текст;
		СтрокаТаблицы.Артикул		= ТабДок.Область(НомерСтроки, 2).Текст;
		СтрокаТаблицы.Остаток		= ТабДок.Область(НомерСтроки, 3).Текст;
		СтрокаТаблицы.Цена			= ТабДок.Область(НомерСтроки, 4).Текст;
	
	КонецЦикла;
	
КонецПроцедуры // ПрочитатьExcel_ТабличныйДокумент()

//////////////////////////////////////////////////////////
//	ЗАПИСЬ EXCEL ПРИ ПОМОЩИ ТАБЛИЧНОГО ДОКУМЕНТА
//////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВыполнитьЗаписьЧерезТабличныйДокумент()
	ТабДок = Новый ТабличныйДокумент;
	Для СтрокаНомер = 1 По 3 Цикл
		//Записываем значения строки
		Для КолонкаНомер = 1 По 5 Цикл
			Область = ТабДок.Область(СтрокаНомер, КолонкаНомер);
			Область.Текст = СтрокаНомер * КолонкаНомер;
		КонецЦикла;
		//Записываем изображение
		Область = ТабДок.Область(СтрокаНомер, 6);
		Область.Картинка = Элементы["Изображение" + СтрокаНомер].Картинка;
	КонецЦикла;
	
	ТипФайла = ТипФайлаТабличногоДокумента.XLSX; //Если запись в формате xls - тип файла ТипФайлаТабличногоДокумента.XLS97
	ТабДок.Записать(Каталог + "\Тест.xlsx", ТипФайла);
КонецПроцедуры