
// Пример исправления записей в регистре бухгалтерии без перепроведения документа
// Так же в набор записей устанавливаются доп. свойства чтобы исключить обработку набора при записи в подписках на события
Функция ИсправитьСубконто3ПоСчетуГТД() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Найдено", 0);
	Результат.Вставить("Исправлено", 0);
	
	Россия = Справочники.СтраныМира.Россия;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Россия", Россия);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.НомерСтроки КАК НомерСтроки,
	|	""Дт"" КАК Сторона,
	|	ВЫРАЗИТЬ(Движения.СубконтоДт1 КАК Справочник.Номенклатура).СтранаПроисхождения КАК ПравильнаяСтрана
	|ПОМЕСТИТЬ ВТДвиженияССубконто
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК Движения
	|ГДЕ
	|	Движения.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГТД)
	|	И Движения.СубконтоДт3 = &Россия
	|	И ВЫРАЗИТЬ(Движения.СубконтоДт1 КАК Справочник.Номенклатура).СтранаПроисхождения <> &Россия
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Движения.Регистратор,
	|	Движения.НомерСтроки,
	|	""Кт"",
	|	ВЫРАЗИТЬ(Движения.СубконтоКт1 КАК Справочник.Номенклатура).СтранаПроисхождения
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто КАК Движения
	|ГДЕ
	|	Движения.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГТД)
	|	И Движения.СубконтоКт3 = &Россия
	|	И ВЫРАЗИТЬ(Движения.СубконтоКт1 КАК Справочник.Номенклатура).СтранаПроисхождения <> &Россия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДвиженияССубконто.Регистратор КАК Регистратор,
	|	ВТДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	ВТДвиженияССубконто.Сторона КАК Сторона,
	|	ВТДвиженияССубконто.ПравильнаяСтрана КАК ПравильнаяСтрана
	|ИЗ
	|	ВТДвиженияССубконто КАК ВТДвиженияССубконто
	|ГДЕ
	|	ЕСТЬNULL(ВТДвиженияССубконто.ПравильнаяСтрана, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|ИТОГИ ПО
	|	Регистратор";
	
	ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		НаборЗаписей.Прочитать();
		
		БылиИзменения = Ложь;  
		
		// Заполняем список соответствий
		СоответствияСтрок = Новый Соответствие;
		
		ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЭлементИсправления = Новый Структура;
			ЭлементИсправления.Вставить("НомерСтроки", ВыборкаДетальныеЗаписи.НомерСтроки);
			ЭлементИсправления.Вставить("Сторона", ВыборкаДетальныеЗаписи.Сторона);
			ЭлементИсправления.Вставить("ПравильнаяСтрана", ВыборкаДетальныеЗаписи.ПравильнаяСтрана);
			
			СоответствияСтрок.Вставить(ВыборкаДетальныеЗаписи.НомерСтроки, ЭлементИсправления);
		КонецЦикла;
		                      
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			Если СоответствияСтрок.Получить(ЗаписьНабора.НомерСтроки) = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			
			Исправление = СоответствияСтрок.Получить(ЗаписьНабора.НомерСтроки);
			
			Результат.Найдено = Результат.Найдено + 1;
			
			Если Исправление.Сторона = "Дт" Тогда
				Если ЗаписьНабора.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтраныПроисхождения] <> Исправление.ПравильнаяСтрана Тогда
					ЗаписьНабора.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтраныПроисхождения] = Исправление.ПравильнаяСтрана;
					БылиИзменения = Истина;
					Результат.Исправлено = Результат.Исправлено + 1;
				КонецЕсли;
			Иначе
				Если ЗаписьНабора.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтраныПроисхождения] <> Исправление.ПравильнаяСтрана Тогда
					ЗаписьНабора.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтраныПроисхождения] = Исправление.ПравильнаяСтрана;
					БылиИзменения = Истина;
					Результат.Исправлено = Результат.Исправлено + 1;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если БылиИзменения Тогда 
	   		НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	   		НаборЗаписей.ДополнительныеСвойства.Вставить("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ", Ложь);
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать(); // запись движений напрямую, без проведения документа
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
