
// Добавляет и записывает одну запись через менеджер записей
// Замещать Истина - Замещает только ту запись которая совпадает по набору измерений.
// Замещать Ложь - Будет выборшено исключение если такая запись уже есть
Процедура ДобавитьЧерезМенеджерЗаписи()
	Значение = Новый УникальныйИдентификатор;
	
	МенеджерЗаписи = РегистрыСведений.НезависимыйРегистр.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Изм = Значение;
	МенеджерЗаписи.Рес = Значение;    
	
	МенеджерЗаписи.Записать(Ложь);
КонецПроцедуры

// Добавляет и записывает одну или более записей через набор записей
// Замещать Истина - Замещает все записи (удаляем ВСЕ существующие и добавляет новые)
// Замещать Ложь - Будет выборшено исключение если такие записи уже есть 
Процедура ДобавитьЧерезНаборЗаписей()      
	Значение = Новый УникальныйИдентификатор;
	
	НаборЗаписей = РегистрыСведений.НезависимыйРегистр.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Изм = Значение;
	НоваяЗапись.Рес = Значение;
	
	НаборЗаписей.Записать();
КонецПроцедуры

// Добавляет и записывает одну или более записей через набор записей
// Замещать Истина - Замещает все записи с отбором (удаляем записи указанные в отборе и добавляет новые)
// Замещать Ложь - Будет выборшено исключение если такие записи уже есть 
Процедура ДобавитьЧерезНаборЗаписейСОтбором()                                      
	Значение = Новый УникальныйИдентификатор;
	
	НаборЗаписей = РегистрыСведений.НезависимыйРегистр.СоздатьНаборЗаписей(); 
	// Отбор для периодического регистра
	// НаборЗаписей.Отбор.Период(ТекущаяДата());
	НаборЗаписей.Отбор.Изм.Установить(Значение);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Изм = Значение;
	НоваяЗапись.Рес = Значение;
	
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ПрочитатьВсеЗаписиРегистра()
	ВыборкаЗаписей = РегистрыСведений.НезависимыйРегистр.Выбрать();
	Пока ВыборкаЗаписей.Следующий() Цикл
		Сообщить(СтрШаблон("Изм: %1; Рес: %2", ВыборкаЗаписей.Изм, ВыборкаЗаписей.Рес));
	КонецЦикла;
КонецПроцедуры


Процедура ПрочитатьНаборЗаписей()
	НаборЗаписей = РегистрыСведений.НезависимыйРегистр.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Изм.Установить("1");
	НаборЗаписей.Прочитать();
	Для Каждого Запись из НаборЗаписей Цикл
		Сообщить(СтрШаблон("Изм: %1; Рес: %2", Запись.Изм, Запись.Рес));		
	КонецЦикла;
КонецПроцедуры
