// Добавляем набор записей вне обработки проведения документа.
// т.е. документ нечего не знает об этом
Процедура ДобавитьНаборЗаписейВнеОбработкиПроведения()
	НаборЗаписей = РегистрыНакопления.ОстаткиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Запись = НаборЗаписей.Добавить();
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Регистратор = Ссылка;
	Запись.Номенклатура = Номенклатура;
	Запись.Количество = Количество;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

// Считываем набор записей любого регистратора
Процедура ПрочитатьНаборЗаписей()
	НаборЗаписей = РегистрыНакопления.ОстаткиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Значение = Ссылка;
	НаборЗаписей.Прочитать();
КонецПроцедуры

// Создание набор записей из Обработки проведения документа
Процедура ОбработкаПроведения()
	// регистр ОстаткиНоменклатуры Приход

	// Данное свойство необходимо установить, если мы хотим использовать общую запись для всех движения
	// Движения.Записать()
	Движения.ОстаткиНоменклатуры.Записывать = Истина;

	Запись = НаборЗаписей.Добавить();
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Регистратор = Ссылка;
	Запись.Номенклатура = Номенклатура;
	Запись.Количество = Количество;

	// Есть два способа записать движения

	// 1. Записать все наборы записей из коллекции "Движения". 
	// Записи будут записаны при условии что для регистра установлено "Записывать = Истина"
	// Если не вызвать его явно, то оно сработает не явно. Так что можно его не указывать.
	Движения.Записать();

	// 2. Записать явно набор только по конкретному регистру
	Движения.ОстаткиНоменклатуры.Записать();

КонецПроцедуры
