// Добавляем набор записей вне обработки проведения документа.
// т.е. документ нечего не знает об этом
Процедура ДобавитьНаборЗаписейВнеОбработкиПроведения()
	НаборЗаписей = РегистрыНакопления.ОстаткиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Запись = НаборЗаписей.Добавить();
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Регистратор = Ссылка;
	Запись.Номенклатура = Номенклатура;
	Запись.Количество = Количество;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

// Считываем набор записей любого регистратора
Процедура ПрочитатьНаборЗаписей()
	НаборЗаписей = РегистрыНакопления.ОстаткиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Значение = Ссылка;

	// Объектное чтение. При использовании Управляемого режима блокировок, устанавливает Разделяемую блокировку
	НаборЗаписей.Прочитать();
КонецПроцедуры

// Создание набор записей из Обработки проведения документа
Процедура ОбработкаПроведения()
	// регистр ОстаткиНоменклатуры Приход

	// Ставим Записывать = Истина, чтобы у нас успешно сработала строка Движения.Записать() для все отмеченных регистров
	// Эти галочки снимутся автоматически, если вызвать Движения.Записать() Обычная запись регистра их не снимает 
	Движения.ОстаткиНоменклатуры.Записывать = Истина;

	// Очистить() для движения которые каким-то образом могли к нам попасть с формы
	Движения.ОстаткиНоменклатуры.Очистить();       
	
	// Записать() Записываем пустой набор записей. При перепроведении прошлые движения удаляются только
	// после записи новых движений, в конце транзакции. Но нам нужно чтобы прошлые движения удалились сразу
	Движения.ОстаткиНоменклатуры.Записать();

	Запись = НаборЗаписей.Добавить();
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Регистратор = Ссылка;
	Запись.Номенклатура = Номенклатура;
	Запись.Количество = Количество;

	// Есть два способа записать движения

	// 1. Записать все наборы записей из коллекции "Движения". 
	// Записи будут записаны при условии что для регистра установлено "Записывать = Истина"
	// Если не вызвать его явно, то оно сработает не явно. Так что можно его не указывать.
	Движения.Записать();

	// 2. Записать явно набор только по конкретному регистру
	Движения.ОстаткиНоменклатуры.Записать();

КонецПроцедуры


///////////////////////////////////////////
// МАССОВЫЕ ИЗМЕНЕНИЯ И УДАЛЕНИЯ ЗАПИСЕЙ //
///////////////////////////////////////////

// Вариант для версий ниже 8.3.26
Процедура МассовоеИзменениеЗаписейРегистраСтарое() 
	
	//Шаг 1 - читаем данные
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	Продажи.Период КАК Период,
				|	Продажи.Номенклатура КАК Номенклатура,
				|	0 КАК Сумма // Обнуляем сумму
				|ИЗ
				|	РегистрНакопления.Продажи КАК Продажи
				|
				|УПОРЯДОЧИТЬ ПО
				|	Продажи.Регистратор,
				|	Продажи.НомерСтроки
				|ИТОГИ ПО
				|	Продажи.Регистратор";

	ВыборкаРегистраторов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	//Шаг 2 - записываем данные
	НачатьТранзакцию();
	Попытка
		// Этот цикл идет столько сколько документов = 100 000 раз
		Пока ВыборкаРегистраторов.Следующий() Цикл
			
			НовыйНабор = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
			НовыйНабор.Отбор.Регистратор.Установить(Выборка.Ссылка);
			
			ВыборкаЗаписей = ВыборкаРегистраторов.Выбрать();
			Пока ВыборкаЗаписей.Следующий() Цикл
						
				НоваяЗапись = НовыйНабор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаЗаписей);
				
			КонецЦикла;
			
			НовыйНабор.Записать();
					
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение   	
		ОтменитьТранзакцию();	
	КонецПопытки;

КонецПроцедуры


// Вариант для версий 8.3.26 и старше
Процедура МассовоеИзменениеЗаписейРегистра()

	//Шаг 1 - читаем данные
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Продажи.Регистратор КАК Регистратор,
	|	Продажи.НомерСтроки КАК НомерСтроки,
	|	Продажи.Номенклатура КАК Номенклатура,
	|	0 КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи";

	ВыборкаЗаписей = Запрос.Выполнить().Выбрать();

	//Шаг 2 - записываем данные
	НовыйНабор = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НовыйНабор.РасширенныеРежимыЗамещения = Истина;
	НовыйНабор.Отбор.Сбросить();

	Пока ВыборкаЗаписей.Следующий() Цикл
		
		НоваяЗапись = НовыйНабор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаЗаписей);
		
	КонецЦикла;

	НовыйНабор.Записать(РежимЗамещения.Обновление);

КонецПроцедуры

// Вариант для версий 8.3.26 и старше
Процедура МассовоеУдалениеЗаписейРегистра()

	//Шаг 1 - читаем данные
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продажи.Регистратор КАК Регистратор,
	|	Продажи.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Сумма > 0";

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	//Шаг 2 - формируем набор к удалению и удаляем данные
	Набор = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	Набор.РасширенныеРежимыЗамещения = Истина;
	Набор.Отбор.Сбросить();

	Пока РезультатЗапроса.Следующий() Цикл
		
		НоваяЗапись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, РезультатЗапроса);
		
	КонецЦикла;

	Набор.Записать(РежимЗамещения.Удаление);

КонецПроцедуры