// Добавляем набор записей вне обработки проведения документа.
// т.е. документ нечего не знает об этом
Процедура ДобавитьНаборЗаписейВнеОбработкиПроведения()
	НаборЗаписей = РегистрыНакопления.ОстаткиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Запись = НаборЗаписей.Добавить();
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Регистратор = Ссылка;
	Запись.Номенклатура = Номенклатура;
	Запись.Количество = Количество;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

// Считываем набор записей любого регистратора
Процедура ПрочитатьНаборЗаписей()
	НаборЗаписей = РегистрыНакопления.ОстаткиНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Значение = Ссылка;

	// Объектное чтение. При использовании Управляемого режима блокировок, устанавливает Разделяемую блокировку
	НаборЗаписей.Прочитать();
КонецПроцедуры

// Создание набор записей из Обработки проведения документа
Процедура ОбработкаПроведения()
	// регистр ОстаткиНоменклатуры Приход

	// Ставим Записывать = Истина, чтобы у нас успешно сработала строка Движения.Записать() для все отмеченных регистров
	// Эти галочки снимутся автоматически, если вызвать Движения.Записать() Обычная запись регистра их не снимает 
	Движения.ОстаткиНоменклатуры.Записывать = Истина;

	// Очистить() для движения которые каким-то образом могли к нам попасть с формы
	Движения.ОстаткиНоменклатуры.Очистить();       
	
	// Записать() Записываем пустой набор записей. При перепроведении прошлые движения удаляются только
	// после записи новых движений, в конце транзакции. Но нам нужно чтобы прошлые движения удалились сразу
	Движения.ОстаткиНоменклатуры.Записать();

	Запись = НаборЗаписей.Добавить();
	Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
	Запись.Регистратор = Ссылка;
	Запись.Номенклатура = Номенклатура;
	Запись.Количество = Количество;

	// Есть два способа записать движения

	// 1. Записать все наборы записей из коллекции "Движения". 
	// Записи будут записаны при условии что для регистра установлено "Записывать = Истина"
	// Если не вызвать его явно, то оно сработает не явно. Так что можно его не указывать.
	Движения.Записать();

	// 2. Записать явно набор только по конкретному регистру
	Движения.ОстаткиНоменклатуры.Записать();

КонецПроцедуры
